Revit 2027 API
RailSupportJustification Enumeration
 The justification of the rail supports.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailSupportJustification
Public Enumeration RailSupportJustification
public enum class RailSupportJustification
type RailSupportJustification
Members
Member name | Value | Description
Begin | 0 |  Supports are justified to the beginning of the rail.
Center | 1 |  Supports are justified to the center of the rail.
End | 2 |  Supports are justified to the end of the rail.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace